# 1) სია შემდგარი 10 ელემენტისგან, და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტი
# items =["nika","luka","giorgi","demetre","lado","vano","amirani","lazare","omari","anita"]
# for i in range(10):
#     for i % 2 == 1:
#         print(items[i])
        
# 2)შექმენით სია რომელიც შედგება 5 რიცხვისგან, გადაუარეთ ამ სიას for ციკლით და შეაჯამეთ თითოეული რიცხვი, ბოლოს გამოიტანეთ ამ რიცხვების ჯამი (დაგჭირდებათ ერთი დამატებითი დამთვლელი ცვლადი (ჯამის ცვლადი, რომელსაც თითოეული რიცხვი დაემატება ყოველ იტერაციაზე))
class_items =[3,63,92,75,93,]
sum = 0
for i in class_items:
    print(class_items)
    sum += i
# 3)შექმენით სია შემდგარი 10 რიცხვისგან, გადაურეთ for ციკლით, შეამოწმეთ კენტია თუ ლუწი, თუ ლუწია დაბეჭდეთ i, "luwia", თუ კენტია i, "kentia"
random_items =[23,454,86,98,45,76,57,7,33,12]
for i in random_items:
    print(i)