# 1)კომენტარებით ახსენით განსხვევება indexing-სა და sliceing-ს შორის.
# sliceing aris ai magalitad ramis amoreba rom gvinda siidan

# 2)შექმენით სია სადაც გექნებათ 5 ელემენტი და მინუს ინდექსების გამოყენებით გამოიტანეთ ბოლო 3 ელემენტი
name =["nika","nino","merabi","mari"]
print(name[1:4])
# 3)შექმენით სია სადაც გექნებათ 10 რიცხვი, გადაუარეთ ამ სიას და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია ან ტოლია 10ზე
number = [32,34,657,86,44,86,47,72,38,9374]
for i in number:
    print(i > 10)
# 4)კომენტარის სახით ახსენით რა არის ფუქნცია, რაში ვიყენებთ და ჩამოწერეთ ყველა ნასწავლი ფუნქცია (გვერდით მიუწერეთ მათი დანიშნულება)
# funqcia aris mag type print ass...
# 5)(***BOSS LEVEL***) მომხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შეეკითხეთ უნდა თუ არა რომ მისი გვარი გადაიყვანოს დიდ ასოებად, თუ გიპასუხათ "yes"
# მაშინ დაუბეჭდეთ მისი სახელი დიდი ასოებით, თუ გიპასუხათ "no" ბეჭდეთ უბრალოდ მისი სახელი. (მინიშნება: გაკვეთილის ბოლოს განვიხილეთ ზედაპირულად)
name = input("please enter your surname: ")
print("no")