# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.
#  items =[32,32,65,77,21,63,75]
# print(items[*])
# 2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.
names =["nika","mari","merabi","nino","qetevani","demetre","luka","giga","vano","lado"]
print(names[0:8])
# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.
i =[54,67,95,3,45]
for i in range(5):
    print(i > 5)
# 4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.
homes_items =[45,34,324,23,87,65,78,65,45,5,]
sum in range(5)
print(45+34+324+23+87+65+78+65+45+5)
# 5)კომენტარებით ახსენით რისი გაკეთება შეგვიძლია slicing ით.
#ai magalitad ramis amowra rac ar gvwirdeba