#1)შექმენით 2 ცვლადი სახელად დაარქვით მაგალითად:num1 და num2, მნიშვნელობებად გადაეცით რიცხვები და მოახდინეთ მათზე მათემატიკური ოპერაციები, მაგალითად :მიმატება(+),გამოკლება(-),გამრავლება(*),გაყოფა(/) და კომენტარებით ახსენით თითოეული ოპერაცია რას აკეთებს

num1 = 65
num2 = 90
print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)

#2)შექმენით ცვლადი age და მნიშვნელობად გადაეცით თქვენი ასაკი,შექმენით ახალი ცვლადი სადაც იქნება თქვენი ასაკი 5 წლის შემდეგ, ბოლოს კი გამოიტანეთ რამდენი წლის იქნებით 5 წლის შემდეგ.
age = 13
age_in_5_years = 5
print(age + age_in_5_years)


#3)შექმენით ორი ცვლადი  რომელსაც მნიშვნელობად გადასცემთ თქვენს ასაკს მეორეში კი მშობლის ასაკს ,შემდეგ კი თქვენი ასაკი და მშობლის ასაკი გაამრავლეთ ერთმანეთზე.

my_age = 13
my_mother = 37
print(my_age * my_mother)

#4)4)თქვენი ოჯახის წევრების ასაკები ჩამოწერეთ ცვლადების სახით, დაპრინტეთ მათი ასაკები ხელმეორედ, 2 წლის შემდეგ.


my_ages = 13
print(my_ages + 2)

my_mothers = 37
print(my_mothers + 2)

my_father = 40
print(my_father + 2)

my_sister = 11
print(my_sister + 2)

#5)შექმენით ცვლადი name რომელშიც შეინახავთ თქვენ სახელს და შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა და ჩაწერეთ თქვენი მეგობრის სახელი, საბოლოოდ დაბეჭდეთ name ცვლადი



name = "nikoloz"
Name ="giorgi"
print =name

