# 1)შექმენით სია შემდგარი 5 ელემენტისგან და გამოიტანეთ ამ სიის თითოეული ელემენტი ინდექსებით
random_items =["nika", 55, True, 14.1, "giorgi" ]
print(random_items[3])
# 2)შექმენით სია შემდგარი 10 ელემენტისგან და გამოიტანეთ თითოეული ელემენტი for ციკლით / range() ფუნქციითაც და პირდაპირ ცვლადის გადაცემითაც
class_items =["nika", "mari", "nino", "merabi", "elene", "giorgi", "demetre", "mate", "irakli", "lela"]
print(class_items[7])
# 3)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე
goa_items =[5, 14, 9, 61, 99, 4, 23, 7]
for i  in range > 10:
    print(i)
# 4)შექმენით სია შემდგარი 7 განსხვავებული ემენეტისგან და for ციკლის მეშვეობით შეამოწმეთ თითოეული ემენეტის მონაცემთა ტიპი
random_items =["nika", 55, True, 14.1]
print(random_items[3])