# 1)გამოიტანეთ რიცხვები 0-დან 10-ის ჩათვლით
i=10
for i in range(1,10):
      print(i)
      i = i + 1
 # 2)გამოიტანეთ რიცხვები 50-დან 150-მდე
i=150
for i in range(50,150):
     print(i)
     i = i + 1
 # 3)გამოიტანეთ მხოლოდ ლუწი რიცხვები 200-დან 500-მდე
i=10
for i in range(200,500,2):
       print(i)
       i = i + 1
# 4)გამოიტანეთ კენტი რიცხვები 0-დან 50-მდე
i=10
for i in range(1,50,2):
        print(i)
        i = i + 1
#   5)მომხმარებელს შემოატანინეთ მისი გვარი და გამოიტანეთ ამ გვარის თითოეული ასო ცალცალკე
surname = (input("enter your surname: "))
for i in surname:
      print(i)
#6)კომენტარის სახით ახსენით როდის ვიყენებთ For Loop-ს

# 1)გამოიტანეთ რიცხვები 10-დან 15-მდე
i=10
for i in range(10,15):
      print(i)
      i = i + 1

# 2)გამოიტანეთ რიცხვები 50-დან 0-მდე
i=50
for i in range(50,0):
      print(i)
      i = i - 1
 #3)კომენტარის სახით ახსენით რა არის counter ცვლადი და როდის ვიყენებთ While Loop-ს
#  4)გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
i=50
for i in range(10,70,2):
      print(i)
# 5)გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე
i=50
for i in range(25,55,2):
     print(i)